-- 创建数据库
create database lightnovel CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
-- 切换到数据库
use lightnovel;
-- 创建用户表users
create table users (
    id int unsigned auto_increment primary key not null comment '用户 id',
    phone char(11) not null comment '用户 手机号',
    password varchar(32) not null comment '用户 密码',
    username char(10) not null comment '用户 呢称',
    avatar varchar(255) not null default "/assets/images/users/avatar_default.png" comment '头像 路径',
    book_coin decimal(10) not null default '0' comment '书豆余额'
);
insert into users(phone, password, username) values
('15973381344', 'bfda7bb176421340cba445f8465de887', '书友12345678'),
('17851831895', 'bfda7bb176421340cba445f8465de887', '书友12345678'),
('18851831895', 'bfda7bb176421340cba445f8465de887', '书友22345678');




-- 创建书架bookrack
create table bookrack (
    id int unsigned auto_increment primary key not null comment '书架 id',
    users_id int unsigned not null comment '用户 id',
    novel_id int unsigned not null comment '小说 id'
);
insert into bookrack(users_id, novel_id) values(1, 1),
(1, 2),
(1, 3),
(2, 1),
(3, 2);
-- 查询某用户加入到书架的小说id select * from novels where id in (select novel_id from bookrack where users_id = 1);

-- 创建小说表novels
create table novels (
    id int unsigned auto_increment primary key not null comment '小说 id',
    novel_title varchar(255) not null comment '小说 标题',
    novel_desc varchar(900) not null comment '小说 简介',
    novel_author char(10) not null comment '小说 作者',
    novel_url varchar(2083) not null comment '小说 图片'
);
insert into novels values(null, '大神求翻牌子', '人怂志气大的苏以乔在游戏中守了那么长时间的男神居然是个渣男！一时间苏以乔看破红尘一雪前耻。 前夫太渣怎么办?离婚打脸。 绿茶戏太多怎么办?鼓掌叫好。 魔教教主缺个夫人怎么办? 嗯?这教主长得好生俊俏，小女子决定“弃暗投明”！ 看鬼畜活泼人还怂的貌美学妹×腹黑腹黑非常腹黑的学校男神，游戏里游戏外的绚烂火花。 “男神，你好像一颗大白兔，又白又甜又可爱！”', '一剑如故', 'http://127.0.0.1:1314/upload/1132437923371.jpg'),
(null, '秘宋', '正经版本介绍：主角穿越回大宋年间，炼不了钢铁烧不了玻璃，可怜的文科生挣扎在北宋年间。只是一腔热血偏生不冷，凭借着信息大爆炸年代对于间谍行当的了解，硬要为这天下苍生，重铸华夏锋刃！简洁流介绍：大宋版24小时爽文流介绍：收美女？过时了。主角有点品味行不行？后宫团怎么也得名门贵女，才对得起咱们主角！不是大宋宰执的女儿，不是名满天下的才女，好意思跟主角拉扯？主角君很有节操的！', '荆洚晓','http://127.0.0.1:1314/upload/201710161627176409.jpg'),
(null, '天上掉下个小二宝', '李嘉颜，一个老公宠爱儿子喜爱的幸福女人，生活的还算悠闲惬意，可忽然有一天，咣叽，一个忽如其来的二宝从天而降，打破了她现有的生活，她乱了，平静的生活也随之波澜起伏。', '糖炒咖啡', 'http://127.0.0.1:1314/upload/1190107797021.jpg'),
(null, '逐魂录','十年前，他亲手结束了父亲的生命。为了继承父亲生前的使命，他加入了那个父亲曾经引以为傲的组织。然而，他的目的并不在此。父亲的死另有隐情、更大的阴谋正缓缓浮现，他在寻找真相的过程中，却也在逐渐接近死亡……', '李寻希', 'http://127.0.0.1:1314/upload/1132177860674.jpg'),
(null,'龙门阵','龙门阵讲述以四川民间的神秘文化为背景的探险故事，展述三星堆的玄奥秘辛，野人沟的传说，黑竹神庙，守护神兽灵犬雪狮，苗疆蛊事，主人公鲜以和做私家侦探的朋友冉英俊冉大胖子一起以寻找“太阳轮”起始，一步步揭开川苗地区的神秘文化的面纱。','罗晓','http://127.0.0.1:1314/upload/201712261741391310.jpg'),
(null,'京华一江春','清末民国初，北京城风起云涌，一江春这个小小二荤铺更是几经磨难;不过江春水始终坚信，虚假的繁华终会落幕，恶人的张牙舞爪总会停歇，只要她初心不改，定会扬声高唱太平歌。','小染','http://127.0.0.1:1314/upload/1167257860984.jpg'),
(null,'神医悍妃：杠上腹黑邪王','为了复仇而来，为了权利，她和他成亲，本以为只是一桩交易，殊不知这是一个披着人皮的腹黑狼设下的陷阱。她咬牙切齿，满脸怨恨，阴鸷的眼神看着他：“你竟敢捉弄我，你找死。”“别，为夫还不想死。为夫要和你相亲相爱过一生呢。云曦，只要你在我身边，哪怕你要把南曜国弄得天翻地覆，我也会帮你。','阿楚','http://127.0.0.1:1314/upload/201707191010233919.jpg'),
(null,'重生九零之麻辣小鲜妻','前世蒙蔽双眼，穆唯西深陷诡秘陷阱，亲手害得最爱自己的人入了黄泉，重生归来，她竟有两幅嘴脸，人前冷厉如魔鬼，虐渣男斗白莲惩极品，而在江枫眠面前，她却变得非常软弱，可能是那份愧疚在作怪吧，穆唯西此生最大的心愿便是，余生陪伴在江枫的身边……','非韩','http://127.0.0.1:1314/upload/1115597502547.jpg'),
(null,'让我陪你吃饭吧','童铭菲带着去世姐姐留下来的儿子，在这个社会艰难求生，一边上班一边做美食视频博主，直到有一天她联系上了打赏榜上排名第一的那个男人……','金刚圈','http://127.0.0.1:1314/upload/1127477958926.jpg'),
(null,'诸天纪','诸天万界之间，有一处名为罗浮的世界，十万年生，十万年灭，世间万物亿兆生灵，便在这二十万年一次的生灭当中沉沦，周而复始循环不休，直到这一年，一个数万年前就已经死去的少年在藏剑阁当中醒来……','庄毕凡','http://127.0.0.1:1314/upload/201903121847406892.jpg'),
(null,'农门丑妇','家有哑巴弟，又有极品亲。爹老实来娘受气。无辜受灾失清白，还被爷奶活溺死。连笑生说：连凤丫这闺女真倒霉，长得丑就算了，还被个陌生男人夺了清白，被夺了清白也就算了，狠心亲戚个个下黑手盼她死。不过既然她穿来了，那定要用这具身体，活一个锦绣前程！可是，这肚子最近怎么越来越大？这突然冒出来的冷艳美男又是哪个鬼？萧凤年说：我是娃他爹。啊？你说什么？我耳朵失聪了，听、不、见！','池凤起','http://127.0.0.1:1314/upload/1122836841674.jpg'),
(null,'我家洗衣机是外星人集散地','我们无数次仰望星空，却从没想过，外星人可能就在你我身边？外星人正如你我一样，也会为了生活奔波，也会为了世俗所累，也会被催婚催到离家出走，有好有坏，亦善亦恶。而当刘皓白打开洗衣机的时候，外星人来了。“大姐，有话好好说，咱们把枪先放下，吃巧克力不？” “巧克力是什么？” “连巧克力都没吃过？你不会是外星人吧？”','苏翎羽','http://127.0.0.1:1314/upload/1172977916775.jpg'),
(null,'星际江湖','浩瀚的星际大时代，一个贫民区长大、怀着机甲梦想的少年，当他进入梦想之中，迎接他的是波澜壮阔的星际江湖！他不光有高超的机甲格斗技巧，还有那外科医生般精准的刀法，他把杀人演绎成了一种艺术，在那千万人中挥洒自如，闲庭信步，不沾上一滴鲜血，一刀一刀，行云流水，没有丝毫阻滞……','罗霸道','http://127.0.0.1:1314/upload/113971102494.jpg'),
(null,'猫性总裁：恋爱不如养只猫','他是帝都身价最高的男人，却变成她的猫？他每天卖萌，为的就是能多得到她一点关心，多被她带出去玩玩，最好能牢牢占据主人的心……敢欺负我的女人，破产只是开始，他就算变成猫，也要好好守护她的安全。','蝎子爱上天蓝','http://127.0.0.1:1314/upload/1115027405297.jpg'),
(null,'玄天武神','武神传承，纵横大陆！九转神功，吞天噬地！手握日月掌星辰，世间无我这般人！','步非凡','http://127.0.0.1:1314/upload/1191696690593.jpg'),
(null,'寐语真言','宋安暖，遇血为盟，沾取别人的血液后，可以读取对方的意识。从此，她就像拥有了一面照妖镜。坑害自己的闺蜜，觊觎自己男人的女同事，心怀不轨的男上司……看她如何将各路牛鬼蛇神，妖魔鬼怪通通打回原形。','清风知我','http://127.0.0.1:1314/upload/1116287705195.jpg'),
(null,'圣祖','★精华简介★ 这是一个全新升级的封神世界。这里有纣王，姜子牙，苏妲己，杨戬都将是全新的定位，这里有皇者，火云洞三皇；这里有圣人，道门三清；这里也有上古神魔，蚩尤，刑天；这里将有一个名为罗烈的少年，开启一个“我非英雄，却也盖世无双”的新封神时代！','傲天无痕','http://127.0.0.1:1314/upload/201903121846461623.jpg'),
(null,'美食王妃：王爷很好吃','沈一楠做梦都没想过会穿越到一个受人欺凌而死的草包王妃身上，好在她还是个美食博主，生平最拿手的就是用美食照顾好自己的胃。为了能在王府生存下去，只能亲自动手，丰衣足食！至于那位王爷，也是闻香认主，爱妃炒的一手好菜，以后这个家，就你说了算吧！','招财小九','http://127.0.0.1:1314/upload/1199017787060.jpg'),
(null,'恋爱大师百分百','男性的莫谎重生，变成女性的莫心言。她能在爱人之间看到三个数字，对爱情投入的金钱，精力，以及对伴侣的重视程度。
随着知名度的提升，她也接手各种恋爱，爱情相关的委托。每份爱情背后，都有一份真挚。一次次爱情故事，让莫心言越来越看淡爱情，毕竟男心女...','到处都有的小二','http://127.0.0.1:1314/upload/1108687916777.jpg'),
(null,'农女巧儿的致富日常','穿越成农女，人穷还遇赌鬼爹！好在她还有好阿公。一手掌勺一手配药，带上阿公，全家富！伯娘嚣狂，还想暗算，前面是坑，我不提醒。捡到阿丑，人人嘲笑，她神手一治，摇身一变成状元男神！这是一个重生农女种田发家致富顺便收获爱情的田园故事。','绯离天','http://127.0.0.1:1314/upload/1150617902279.jpg'),
(null,'噬天至尊','得至尊心者得天下！原本这只是一个传说，直到那一日，至尊心从天而降，落在刚出生的唐天体内，一场旷世浩劫随之爆发，至尊心被一分为五，但不知为何，被挖去至尊心的唐天并未死去，从此，这世上多了一个无心之人！十六年后，唐天自中唐学院崛起，一路披荆斩棘，成就无上传奇！PS：已有450万字玄幻作品《不死狂帝》，质量保证，欢迎入坑！','轻弹烟灰','http://127.0.0.1:1314/upload/1172487918072.jpg'),
(null,'十家锅灶九不同','赵思涵还没从“睡觉睡到自然醒，数钱数到手抽筋”的幻想中醒来，就被从天而降的弟妹炸了个体无完肤。父亲生病，丈夫出轨，闺蜜离婚……她幻想的阳光明媚午后和几个闺蜜的下午茶时光，肆无忌惮地背着单反游山玩水的惬意日子都一去不复返。家家有本难念的经，十家锅灶九家不同。','宁余心','http://127.0.0.1:1314/upload/201808091028386075.jpg'),
(null,'最强狂暴兵王','人不可貌相，看似小人物，实则隐世高手。姜川，一个生活在底层的外卖小哥，在大家眼中他就是一个身份卑微，人人可欺的穷小子。一次送餐路见不平却得知罪了富二代，隐藏多年的兵王身份败露，引来仇家，在都市引起了一阵腥风血雨！','富猫','http://127.0.0.1:1314/upload/1180567921260.jpg'),
(null,'明谋善赖','四年前的爱恨纠葛，让江城成了杜若茗此生的禁忌之地。四年后，为了筹到给学校修桥的钱，她“铤而走险”再涉险地，却一脚踏进了前夫精心谋划的陷阱里……','庄妮','http://127.0.0.1:1314/upload/201709121734003322.jpg'),
(null,'龙神归来','天才少年，武灵未醒，修为不进，人人欺凌。幸得白龙玉佩，觉醒至尊龙魂，从此踏上了逆天之路。天子骄子，传奇人杰，无敌传说有如何？若敢逆我，翻手镇压便是。天若顺我，一切好说，天若逆我，我敢让天穹裂！','贱圣君','http://127.0.0.1:1314/upload/201705221457179539.jpg'),
(null,'虚灵人',' 神仙做久了也要退休，也得脱离天庭;鬼王做错事了也得下岗；人类不努力工作更是得炒鱿鱼;只有你跟我才是这宇宙间最持久最完美的搭档，因为你有最优秀的灵魂我有最唯美的肉身。你我携手可以拯救灵魂，改造三界，奏乐于宇宙间。茶灵王的这句口头禅勾起了心智不全，凡事比人慢半拍的李想想的好奇心，她迫切的想要随茶灵王去三界旅旅游一探究竟。','蛊眛妖姬','http://127.0.0.1:1314/upload/1199317797121.jpg'),
(null,'末日堡垒','　以点连线，以堡筑基厄世归来，王羿深知丧尸凶猛。为了在末世中活下去，王羿携娇妻，带部下，一路向北，末路逃亡。为了在末世中更好的活下去，王羿兴科技，融万钢，打造末日堡垒，抵御丧尸侵袭！
','一加一等于几','http://127.0.0.1:1314/upload/1151507895784.jpg'),
(null,'我有五个男朋友','《恋爱大乱斗》这款游戏可以满足你的恋爱幻想。陆雨：我信了你的鬼，你这个破游戏坏得很。破游戏规则粗暴无比，同时交往五个男朋友，还不能翻船，不然主角就会自爆！','葵七','http://127.0.0.1:1314/upload/1125117916772.jpg'),
(null,'夜留余白','黎夜光坚信世上无难事只要手段狠，可遇到余白后她才发现，追名逐利的快乐竟敌不过荒野深山里的一个吻。
好画需留白，人生应如是。独立策展人VS壁画修复师，女主强势、好胜、有心机，男主小、土、狗。','漠兮','http://127.0.0.1:1314/upload/1126207663113.jpg'),
(null,'考官，求pass','H市又在下大雨。但是在雅思口语考场内，刚结束面试，潇洒关掉录音笔的帅气考官笑得却像H市少见的阳光。简轶盯着录音笔看了两秒，确认它确实已经关了以后，从牙缝里挤出几个字：“唐先生，如果你这次还给我5.5，我现在出门就去投诉你！”','谢知舟','http://127.0.0.1:1314/upload/201805141642268039.jpg '),
(null,'薛小苒的古代搭伙之旅','薛小苒穿越了，睁眼就落入了荒无人迹的原始森林中，捡到一个半死不活又残又丑的男人，两人在丛林中苦逼求生，挣扎着相携走出丛林，开启一段异世生存之旅，可就在日子慢慢朝好的方向转变时，男人不仅越变越好看，连他的身份都陡然一变！哎，说好的搭伙过日子呢？怎么变得不一样啦？那谁，你到底是何方妖孽？——这是一个吃货在古代吃吃喝喝，混混日子，顺便拐个极品郎君的故事。','千墨','http://127.0.0.1:1314/upload/1101767884683.jpg'),
(null,'农家小寡妇：带着包子种种田','一睁开眼，悲剧发现自己成了农家寡妇，更悲剧的是此人长相丑陋，名声极臭。 亲娘不爱，婆家嫌弃，身边还带着一个软萌小包子。 家徒四壁的茅草屋，再看看可怜兮兮的小包子。 暮清妍撸起袖子，赚钱养小包子。 日子一红火，极品亲戚一个个上门闹。 我去，真当她是软包子，任由你们揉捏。大手一挥，直接扫人出门。 等等，那汉子是咋回事！说好嫌弃她，怎天天送鱼送鸡，最后还将自己给送上。 囧，姐姐准备养包子，不养汉子！','夜子柒','http://127.0.0.1:1314/upload/1148666962538.jpg'),
(null,'我的狐王男友','一个是妖族狐王，一个是只能隐藏身份的女巫，两人本不该有任何的牵扯，但是，缘分这种东西，谁知道呢？还不是在六千年前就相遇相爱？还不是在沉睡了六千年后依旧的相爱？都是愿意为了心爱之人而放弃一切之人，怎么会没有一个好的结局？即便是困难重重，但是在爱的面前什么都不算了，我的狐王，我，永远都是你的狐后！','简落离','http://127.0.0.1:1314/upload/1172587473196.jpg'),
(null,'隔壁住着龙','凌楠意外发现新公司的董事长韩商陆与两年前过世的未婚夫重越长得一模一样，同时韩商陆性格古怪举止神秘的堂弟韩骞成为了自己的邻居。一顿操作猛如虎之后，她以为自己招惹的是只小狼狗，没想到隔壁住的却是活了千年的喷火龙……凌楠：我是在帮你！我这么做全都是为了让你免遭毒手！韩骞：别费心思了，我自己就是毒手。','成骨为衣','http://127.0.0.1:1314/upload/201808091024125261.jpg'),
(null,'大梁诡案录','洛州知府凌寒断案如神，人称“在世狄公”。如今却因未能如期破案，被梁帝贬黜流放崖州。原来近日洛州城内发生一桩奇案。皇亲张员外爱女巧儿在远嫁金陵的途中离奇失踪，一同失踪的还有新郎卢邻。整支迎亲的队伍全部离奇死亡，死相狰狞。这些人均被一种嗜血牡丹的枝蔓刺破五脏六腑，奇经八脉，最终七窍流血而亡。唯一幸存者是一位陪嫁丫鬟，只是她不知道受了什么刺激，疯癫的厉害……','闲看桂花落','http://127.0.0.1:1314/upload/1154577909838.jpg'),
(null,'茗门闺秀','父亲早逝，母弱弟幼，二叔觊觎家产，苏玉畹身为长女，撑起了苏家大房的茶叶生意。
 小商户未婚夫：“抛头露面成何体统？退婚吧。” 
某候府世子赞道：“这婚退得好！”','嘉木','http://127.0.0.1:1314/upload/1115747404676.jpg'),
(null,'重生七零末：逆袭小辣媳','被继母抢夺家产，扫地出门的苏云叶，用了十一年时间，熬尽心血，斗败继母，夺回自家产业，成长为叱咤商场的女总裁。好日子终于到来，她的身体却不堪重负……再度醒来的苏云叶，发觉自己重生到70年末，另一个‘苏云叶‘身上。这个‘苏云叶‘性格懦弱，任人欺凌，遭所谓‘亲人’联手陷害。手段强硬、精明干练的苏总，将所有极品扫成渣，带着老妈和小妹，重拾老本行，再度逆袭，走上人生巅峰……','云茯苓','http://127.0.0.1:1314/upload/1166467907186.jpg'),
(null,'恋恋不忘，必有回响','都说婚姻是爱情的围城，那么没有爱情的婚姻？属于什么？一张结婚证，让颜歌和相恋多年的男友分道扬镳，在亲情和爱情之间抉择，她是被放弃的那一个…
为了报复，她找了另一个人结婚，却踏入了另一段人生。
总有一个人会爱你如生命，把你捧在手心里，不离不弃。','沈默凡','http://127.0.0.1:1314/upload/1156987526273.jpg'),
(null,'急诊风云','对于成为急诊医生这件事，一开始安菲是抗拒的，后来的成长是享受的，最终的结局是完满的，只是这一路走来有爱情、友情、亲情；有血、有泪、有遗憾；有那么多的不可忘却，却是她万万没有想到的。','翡翠蝴蝶','http://127.0.0.1:1314/upload/201706221508479918.jpg'),
(null,'乒乓球的11种爱情技巧','　　伊依作为一名初出茅庐的解说员，立志要解说好每一场比赛。　　不过……现实往往与之相反。　　伊依：喂！男神，醒醒啊！现在是比赛！　　伊依：男神让着点对手，别让对手输的太难看。　冠军乒乓球手只好在赛场上乖乖的让了两局。　　青春与梦想不会散场，愿每一个人的一生都享受在绚烂的青春中。','喵老师','http://127.0.0.1:1314/upload/201711071524382361.jpg'),
(null,'第N次初见你','人质谈判专家柳研司因为脑部受伤回国寻找医治方法，唯一能给他希望的就是二十年未见的父亲。没想到回国当晚父出了车祸，临终前将仅存的“仿生脑模”送给了面临脑死亡的女孩儿汤愿，柳研司想要给自己的大脑打个补丁必须得到汤愿脑袋里的仿生脑模。
事实上，想要得到脑模的不只是柳研司，随着各方介入，似乎变成了一场暗流涌动的争夺战。
','胡炣','http://127.0.0.1:1314/upload/1165627785703.jpg'),
(null,'花田喜事：腹黑小农女','不小心穿越到古代的大东北，田荷花很想仰天长啸，这鬼地方冻得鸟都不拉臭臭，老天爷你是在跟我开玩笑吗！？没办法，只好咬着牙带着全家奔小康，养成个金龟婿再生几个娃……啥？说俺思想不纯洁，光想着生娃？这死冷寒天的破地方，不生娃能干啥？！只不过，说好的小可怜男娃，怎么分分钟变身腹黑大灰狼？小荷花欲哭无泪，被吃干抹净的怎么会是她？','凌珑','http://127.0.0.1:1314/upload/201710311143395642.jpg'),
(null,'有船自远方来','有船自远方来，不亦乐乎？
有船向远方去，不亦乐乎？
舟橹商贾已至，海上丝路重启，海上生财富，不该欢呼乎？','方旻未','http://127.0.0.1:1314/upload/1161287914418.jpg'),
(null,'农门俏厨娘：纨绔夫君来碰瓷','穿越成普通农家女，一睁眼就得面对自家揭不开锅的窘境，大伯一家虐待欺凌，外加奶奶不疼爷爷不爱，要解除困境，叶青能利用的也就是自己的一手好厨艺了。
斗极品，护家人，做美食，带着娘亲姐妹走上致富路，她从零开始积累第一桶金，努力实现自己此生重开酒楼的愿望。
重生路上意外在所难免，她偶然遇见个相貌平平的落难杀手，顺手搭救然后抛却脑后，谁曾想有朝一日再相遇，他竟换了身份面孔！是天定良缘，还是早有预谋？
','宁墨','http://127.0.0.1:1314/upload/1194517934965.jpg'),
(null,'狐姬酒肆','小狐仙胡莹的美酒那是上迷三界下诱众生，偏偏到了宰相秦翎墨这就不好用了，更可气的是救了他一命，却诬陷自己是妖精，还要宗主收了她.
哼！我堂堂狐仙居然怼不过区区人类，迟早要占了你的宰相府!所有的钱钱都是我的!人嘛，也是我的！','莺萝','http://127.0.0.1:1314/upload/1103197184589.jpg'),
(null,'师兄总是要开花','赵坦坦的师兄额头有朵魔花，动情就会渐渐开花，开花就会堕魔。从此赵坦坦开始了苦劝师兄多念经、少动情的艰辛日子。','韩易水','http://127.0.0.1:1314/upload/201710161633534924.jpg'),
(null,'灵武苍穹','他是清虚界最耀眼的天才，但也是我书中的反派，为博红颜一笑，树敌无数，最终败于主角沦为废人，本将等死之人，剧情却发生了转变，因为作者的我离奇成了书中的他，书中主角的强大，大纲的设定，对他来说都是一个巨大挑战，随着迷雾打开，他总感觉有个黑手在篡改他的剧情，让他不断处于绝境之中……','梦三','http://127.0.0.1:1314/upload/201804081613352451.jpg'),
(null,'我的绝色总裁未婚妻','【最火爆畅销书】★精华简介★本书又名《神级龙卫》神秘高手龙潜花都，与冰山美女总裁签订婚约，但无奈被嫌弃。可怜的沈浪，只得外出觅食。不料一个个美女接踵而至，沈浪陷入各种桃运漩涡。当然，最主要的还是征服冰山女总裁。不乖？调教一下就好。','花幽山月','http://127.0.0.1:1314/upload/201803141444064795.jpg'),
(null,'冥龙神尊','【火爆玄幻】斗元大陆，地尊大地横行，玄尊遨游天穹，天尊之威上天不敢犯，九重天界广大无边，洪荒宇宙容纳万物，自地球穿越于斗元大陆的许凌风，本是天才，被废之后，得到冥龙传承，且看他如何一朝化龙，遨游寰宇，成就无上冥龙神尊！ 精华简介：主角构建了一个虚拟世界，要让宇宙之中所有生灵都进入这个虚拟世界之中，然后，身为虚拟世界主宰的主角，想干啥就干啥了…… ','深意童年','http://127.0.0.1:1314/upload/1106997010698.jpg'),
(null,'重生之都市狂仙','剑斩风雷遮日月，掌握乾坤捣幽冥。 世间人有六十亿，唯我一人称骄狂。 仙界青帝重生于灯红酒绿，纸醉金迷的繁华都市。 从此一个前世的都市失败者，彻底翻身，走上了一条让惊得天下纨绔皆惶恐，惹得世间美人尽倾心的绝世之路。 世人笑他猖，世人笑他狂，万古之后的天地，世人几经轮回，而他依然在那，高高在上，俯视众生。','梦中笔丶','http://127.0.0.1:1314/upload/1173867089483.jpg'),

(null,'最佳豪婿','别人都以为他是窝囊废上门女婿，却不知道他是家产万亿的豪门大少。 锋芒不露，却翻手为云覆手为雨。 欺我辱我者，必百倍奉还！','一点寒芒','http://127.0.0.1:1314/upload/1124227955722.jpg'),
(null,'至尊神帝','一代天骄张浩然得到至宝人皇印，却惨遭兄弟陷害，附身于小家族落魄少爷身上。看落魄少爷手握至宝，如何崛起！既然上天给了我重活的机会，那我定要报仇雪恨，恣意人生！天才？圣子？若不服我，皆斩之！','赵香炉','http://127.0.0.1:1314/upload/1189726865973.jpg'),
(null,'太古狂魔','一名身缠七彩恶龙、肩扛古老石棺的白发青年，仰望高高在上的诸天至尊、万古道祖，淡淡道：“诸位，我说我这石棺葬过天，你们信么？”','汉隶','http://127.0.0.1:1314/upload/1187006720460.jpg'),
(null,'洪荒神帝','★火爆新流派★上古神龙被强敌打下天路，化作木桥镇压在莞镇郊外千余载，直到一跛脚少年将之唤醒复现龙身。本以为这纯属意外，却没想跛脚少年竟然也是……','三千道','http://127.0.0.1:1314/upload/1115496813935.jpg'),
(null,'最佳狂婿','结婚三年，别人都认为我只是一个穷叫花子，可他们都不知道，我拥有的，可以改变他们所有人的命运……','忘清风','http://127.0.0.1:1314/upload/1133257957189.jpg'),
(null,'末世裁决者','磅礴的天地能量涌入地球，末世爆发，一切陷入黑暗。在这里，没有丧尸，却有着更为强大的异变者以及来自异位面的生物；在这里，血色才是基调；在这里，杀戮才是常态；在这里，最好的去处就是死亡！辰战重生归来，只想做三件事：第一，变强！第二，保护自己的亲人！','师小生','http://127.0.0.1:1314/upload/1147197061552.jpg'),
(null,'神武剑尊','【玄幻精品】天辰大陆，灵武为尊。落魄少年觉醒断剑真灵，获无上图录，开武脉，夺造化，融神血，一路逆转乾坤。为倾世红颜，横扫八荒六合，决战天下！为男儿一诺，斩尽百万神魔，颠动九霄！一念星辰坠，一剑苍穹碎。他，誓要执掌命运，主宰时空。','洛子云','http://127.0.0.1:1314/upload/201805071040483689.jpg'),
(null,'乡野小渔民','妙手神医，医治百病，无数人跪着求医。乡野渔民，养渔种田，热销全世界，更有无数土豪砸钱购买。','稀饭','http://127.0.0.1:1314/upload/1158447654310.jpg'),
(null,'零点','《零点》构架在多维度文明、史前文明基础上，形成设定的由中国军人组成的英雄矩阵，以科学的角度全新解释世界神话编年史。通过5619部队，代号“零点”的正式组建，保护一批负有神秘使命的科学家前往罗布泊世界深渊，大地之耳探险，途中遭遇沙暴，千年古城遗址现','骠骑','http://127.0.0.1:1314/upload/1159127520672.jpg'),
(null,'总裁的秘密','大学毕业、相亲、裸婚，舒苏以为接下来的日子就是攒钱买房，怀孕生子，结果却发现那个开二手桑塔纳的老公竟然有着亿万身家。“我怀疑自己陷入某富豪的骗婚阴谋了，怎么办？在线等，急！”','苏幕','http://127.0.0.1:1314/upload/201804101519109645.jpg'),
(null,'福地甜园：拐个王爷好种田','一朝穿越成为名满天下的顾氏女，却被预言活不过十六岁，顾云曦满头黑线。我的生活我做主，管他什么预言？顾家大院麻烦多，看她保护母亲弟妹斗极品，带领家人发家致富奔小康某人，你总往本姑娘身边凑，几个意思？娘子，你都把我拐到手了，还能啥意思？吹灯耕田呗。','长白山上的雪','http://127.0.0.1:1314/upload/1130867089610.jpg'),
(null,'诱妻入怀：帝少心尖宠','那夜，他对她的感情越发浓厚，只想宠她上天。前男友嫌她出身低微，所以就分手另寻富家千金。而她却被省城最有权最有钱的男人看上了！从此，他宠她、爱她、呵护她。只要是她想要的，就没有他办不到的。她总是强调他自己出身低微！他却表示自己为她而生，她认为自己没有什么吸引力，他否定她的观点，要让她从内心也真正的自信起来…','诺小颖','http://127.0.0.1:1314/upload/1135227736338.jpg'),
(null,'少帅：你老婆又要逃婚了','不就是想要好好的游个泳吗，怎么就穿到了民国，穿就穿呗，还成了京北少帅府的里的少夫人，这也就认了，可是什么叫做少夫人蛮横无理，胸大无脑？ “报告少帅，有人说少夫人的坏话。” “把嘴都给我缝上。” “报告少帅，少夫人把隔壁李夫人给打了。” “严不严重，不行在加两脚。” “报告少帅，少夫人跑了。” “那还愣着干什么，还不赶紧把我打包好一起给少夫人送过去。”','林萧墨','http://127.0.0.1:1314/upload/1149297865356.jpg'),
(null,'厉少专宠小甜心：宝贝，我错了','“先生，温小姐打了林小姐一巴掌。”管家汇报情况。厉凌夜寒意一现：“把温梦给我叫过来！”片刻后……温梦大摇大摆走了过来：“叫我干嘛。”管家在一旁冷汗淋漓。厉凌夜将人带入怀中，揉捏着她的手：”手还疼不疼？“管家：……温梦：……节操呢？某人：离家出走了。','晋菇凉','http://127.0.0.1:1314/upload/1124617738166.jpg'),
(null,'重返十六岁之小毒妻','重生后，陶榕不需要虚假恶毒的亲人，心怀白月光的丈夫，背后捅刀的朋友，她只要她上一世最为亏欠的女儿。仇怨可以慢慢报，但是女儿要抓紧生出来……“前两年对我冷冷淡淡，现在又突然撩我是什么意思！”“我只想要一个女儿。”“只……只要一个女儿是什么意思，','悠悠哉','http://127.0.0.1:1314/upload/1137347864935.jpg'),
(null,'鬼医毒妃：嫁个绝色小相公','紫千歌，华夏顶尖医学天才，灵魂重生在圣天大陆。医师，毒师，炼丹师，炼器师，阵法师，各类职业玩得风生水起，芊芊素手搅动着大陆风云，一步步走上世人仰望的地位。然而，那一次她头脑发热，嘴贱的调戏了他，从此惹火上身……','拓拔言倾','http://127.0.0.1:1314/upload/201812261738267031.jpg'),
(null,'侯门药香：农家小医妃','二十一世纪中医世家传人，一朝穿越，成了斗方村乔大财主家的二女儿。原主长得虎背熊腰，且好吃懒做，调戏完了村里所有的青年才俊不说，还惹得全村人嫌弃。上有卧病在床老母，中有不成器哥嫂，下有未成年幼弟……乔思容表示，这日子实在没法过了！','高阳君','http://127.0.0.1:1314/upload/1189537892880.jpg'),
(null,'穿越之兽世种田记','穿越远古大陆，到处都是凶猛的兽人，她一个柔弱女子该如何生存？终于，成了一个娃娃的娘亲，兽夫日渐乖顺，叶暖也想开了：“小尾巴，跟娘亲走，咱在这远古大陆脱贫致富奔小康，打造完美大世界。”小尾巴：“……”某人：“你敢！”','柳湘湘','http://127.0.0.1:1314/upload/'),
(null,'天煞帝女','同年同月同日生，一个被批福寿双全，夫荣子贵；一个却被批天煞孤星，孤独终老。一个被捧在掌心娇生惯养，一个还没足月就被自己祖母扔到荒野。两种命运两种人生。姚府内的两声啼哭，似乎向世人宣告:一段不寻常的宿命之旅就此展开......','织女','http://127.0.0.1:1314/upload/201705241857266086.jpg'),
(null,'买个娘子会种田','极品一窝窝，斗斗趣多多。逗逼许清欢：论撒泼儿，姑奶奶还没怕过谁呢？想折腾我？那也得看看你们有没有一身硬骨头。忠犬闵小五：媳妇说啥就是啥，跟着媳妇有肉吃。','柠檬','http://127.0.0.1:1314/upload/1116396772378.jpg'),

(null,'一胎双宝：老公大人体力好','被前男友算计，家破人亡走投无路之际却意外怀孕，一夜惊喜，一胎双宝，带着萌宝却意外招惹了一手遮天的大人物，还被刁难刁难再刁难。大人物宫宸在追回老婆的路上没有想到最坑的却是自己的儿子。儿子给他拉情敌：“妈咪，我不喜欢宫叔叔，我更喜欢我的偶像！”儿子将他当仇人，“坏叔叔，不许欺负我妈咪！”他被儿子推开推开再推开。','乔越','http://127.0.0.1:1314/upload/1111667063285.jpg'),
(null,'本宫腿毛一尺长','前些日子还见那土匪在他那老虎凳上四仰八叉地睡着呢，没想到这些天再见他那满脸地络腮胡都剃的干干净净连根胡茬都看不见，手上涂着丹蔻，脸上抹着胭脂，走路虽然还是那副虎虎生风的样子，但也会低下头来轻声软语地喊一声陛下了。【真的是言情啊，我发誓！】','唐百岁','http://127.0.0.1:1314/upload/1151307834462.jpg'),
(null,'死神的新娘 ','他要杀她。却爱上了她。——在这个世界上为什么会有如此温柔又美好的少年？这是她对他最初的印象。后来，她才发现，原来恶魔总是披着天使的外衣去迷惑世人。','沉默的羔羊','http://127.0.0.1:1314/upload/1100997797140.jpg'),
(null,'恋爱过敏症','18岁元气美少女沈慕念有着一个不为人知的秘密，就是自己曾经在高中拼命想要给自己喜欢的人告白时过敏了，并且险些死掉，而后沈慕念发现只要自己一动感情，就会立马呼吸急促，浑身长满红疹子，越想便越严重，所以自那以后只能关闭心扉，做一名清心寡欲的姑娘。并且沈慕念脱敏的治疗方式只有一个，那就是看恋爱向的漫画，越是肉麻，越是玛丽苏，过敏症状就消失的越快。所以男朋友是什么？能吃吗？！','八月未央','http://127.0.0.1:1314/upload/1137097795044.jpg'),
(null,'发狂','寄生兽是日本的故事，毒液是美国的故事。发狂，是中国的故事。','三鱼','http://127.0.0.1:1314/upload/1159007850443.jpg');
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),
-- (null,'','','','http://127.0.0.1:1314/upload/'),



-- novel_detail 中间表
create table novel_detail (
    novel_id int unsigned not null comment '小说 id',
    detail_id int unsigned not null comment '详情 id',
    click_ratio int unsigned not null default 0 comment '点击率',
    collect_ratio int unsigned not null default 0 comment '收藏率',
    subscribe_ratio int unsigned not null default 0 comment '订阅率',
    hot_vals int unsigned not null default 0 comment '人气值',
    is_recommend tinyint(1) unsigned not null default 0 comment '是否推荐 0不推荐 1推荐',
    last_update int unsigned not null comment '最近更新时间'
);

insert into novel_detail(novel_id, detail_id, hot_vals,is_recommend, last_update) values(1, 1, 500,10, 1571128622),
(2, 2, 6500, 1, 1557909422),
(3, 3, 4700, 1, 1557650222),
(04, 04, 6804, 0, 1557650274),
(05, 05, 8205, 0, 1557650275),
(06, 06, 12806, 1, 1557650276),
(07, 07, 8307, 0, 1557650277),
(08, 08, 8108, 0, 1557650278),
(09, 09, 8409, 0, 1557650279),
(10, 10, 8410, 1, 1557650080),

(11, 11, 12101, 0, 1557650001),
(12, 12, 12102, 1, 1557650002),
(13, 13, 1103, 0, 1557650003),
(14, 14, 12104, 0, 1557650004),
(15, 15, 15105, 1, 1557650005),
(16, 16, 51106, 1, 1557650006),
(17, 17, 12107, 0, 1557650007),
(18, 18, 12108, 1, 1557650008),
(19, 19, 32109, 0, 1557650009),
(20, 20, 12110, 0, 1557650010),

(21, 21, 2401, 0, 1557650011),
(22, 22, 20432, 1, 1557650012),
(23, 23, 2033, 0, 1557650013),
(24, 24, 20434, 0, 1557650014),
(25, 25, 2015, 0, 1557650015),
(26, 26, 20216, 0, 1557650016),
(27, 27, 20217, 0, 1557650017),
(28, 28, 12208, 0, 1557650018),
(29, 29, 32209, 0, 1557650019),
(30, 30, 2130, 0, 1557650020),

(31, 31, 30211, 1, 1557650221),
(32, 32, 30322, 0, 1557650222),
(33, 33, 3013, 0, 1557650223),
(34, 34, 3034, 1, 1557650224),
(35, 35, 30215, 1, 1557650225),
(36, 36, 30316, 0, 1557650226),
(37, 37, 33107, 0, 1557650227),
(38, 38, 33208, 0, 1557650228),
(39, 39, 33209, 0, 1557650229),
(40, 40, 31320, 0, 1557650030),

(41, 41, 40321, 0, 1557650231),
(42, 42, 4202, 0, 1557650232),
(43, 43, 44203, 1, 1557650233),
(44, 44, 4014, 1, 1557650234),
(45, 45, 40325, 1, 1557650235),
(46, 46, 4106, 0, 1557650236),
(47, 47, 40437, 0, 1557650237),
(48, 48, 40438, 0, 1557650238),
(49, 49, 45409, 0, 1557650239),
(50, 50, 41540, 0, 1557650040),

(51, 51, 9201, 0, 1557650281),
(52, 52, 9302, 0, 1557650282),
(53, 53, 12903, 1, 1557650283),
(54, 54, 43904, 1, 1557650284),
(55, 55, 54905, 0, 1557650285),
(56, 56, 65906, 0, 1557650286),
(57, 57, 65907, 0, 1557650287),
(58, 58, 65908, 1, 1557650288),
(59, 59, 23909, 0, 1557650289),
(60, 60, 1910, 0, 1557650090),
(61, 61, 23501, 1, 1557650241),
(62, 62, 32502, 1, 1557650242),
(63, 63, 32503, 0, 1557650243),
(64, 64, 4504, 1, 1557650244),
(65, 65, 2505, 0, 1557650245),
(66, 66, 1506, 0, 1557650246),
(67, 67, 54307, 0, 1557650247),
(68, 68, 13508, 0, 1557650248),
(69, 69, 43509, 1, 1557650249),
(70, 70, 13510, 0, 1557650050),
(71, 71, 12100, 1, 1557650291),
(72, 72, 32100, 1, 1557650292),
(73, 73, 12100, 0, 1557650293),
(74, 74, 32100, 0, 1557650294),
(75, 75, 42100, 0, 1557650295),
(76, 76, 11200, 1, 1557650296),
(77, 77, 12100, 0, 1557650297),
(78, 78, 12100, 0, 1557650298),
(79, 79, 12100, 0, 1557650299),
(80, 80, 21100, 0, 1557650100),
(81, 81, 12601, 0, 1557650251),
(82, 82, 6302, 0, 1557650252),
(83, 83, 60323, 0, 1557650253),
(84, 84, 6024, 0, 1557650254),
(85, 85, 6051, 0, 1557650255),
(86, 86, 6016, 0, 1557650256),
(87, 87, 607, 0, 1557650257),
(88, 88, 608, 0, 1557650258),
(89, 89, 60329, 0, 1557650259),
(90, 90, 61320, 0, 1557650060),
(91, 91, 7011, 0, 1557650261),
(92, 92, 7022, 0, 1557650262),
(93, 93, 12703, 1, 1557650263),
(94, 94, 2704, 1, 1557650264),
(95, 95, 21705, 1, 1557650265),
(96, 96, 12706, 0, 1557650266),
(97, 97, 21707, 1, 1557650267),
(98, 98, 708, 1, 1557650268),
(99, 99, 12709, 1, 1557650269),
(100, 00, 710, 0, 1557650070);


-- detail 详情表
create table detail (
    id int unsigned auto_increment primary key not null comment '详情 id',
    novel_type tinyint(1) not null comment '0 女频，1 男频 2轻小说',
    novel_classify char(4) not null comment '都市 玄幻 仙侠 灵异 历史 游戏 科幻 武侠奇幻 竞技 其他 现言 古言 幻言',
    novel_status tinyint(1) not null comment '0连载 1完结',
    word_nums float(10, 2) unsigned not null comment '字数',
    novel_tags char(20) not null comment '标签',
    novel_paths varchar(255) not null comment '路径'
);

insert into detail(novel_type, novel_classify, novel_status, word_nums, novel_tags, novel_paths) values(0, '游戏', 0, 67.18, '爽文 腹黑 竞技 小说', 'https://www.aliwx.com.cn/reader?bid=7923371&cid=1175017'),
(0, '两宋元明', 0, 187.95, '热血 穿越 极品 小说', 'https://www.aliwx.com.cn/reader?bid=7152276&cid=845715'),
(1, '现代言情', 0, 39.36, '轻松 宝宝 萌文 小说', 'https://www.aliwx.com.cn/reader?bid=7797021&cid=1028433'),
(2, '冒险', 1, 21.09, '热血 爽文 虐文 冒险 小说', 'https://www.aliwx.com.cn/reader?bid=7860674&cid=1097106'),
(0, '悬疑探险', 0, 30.41, '美女 探险 灵异 悬疑 盗墓', 'https://www.aliwx.com.cn/reader?bid=7150952'),
(1, '古代言情', 1, 21.09, '轻松 美食 专情 小说', 'https://www.aliwx.com.cn/reader?bid=7860984&cid=1145107'),
(2, '穿越时空', 0, 19.17, '重生 女强 轻松 腹黑 小说', 'https://www.aliwx.com.cn/reader?bid=7152274'),
(0, '现代言情', 0, 21.09, '爽文 腹黑 正剧 小说', 'https://www.aliwx.com.cn/reader?bid=7502547'),
(1, '现代言情', 1, 35.34, '宝宝 日久生情 美食 小说', 'https://www.aliwx.com.cn/reader?bid=7958926&cid=1174169'),
(2, '古典仙侠', 1, 42.82, '爽文 仙侠 逆袭 小说', 'https://www.aliwx.com.cn/reader?bid=6756593'),

(0, '穿越时空', 1, 60.55, '穿越 极品 架空 小说', 'https://www.aliwx.com.cn/reader?bid=6841674&cid=675816'),
(1, '科幻', 1, 94.46, '爽文 科幻 机智 小说', 'https://www.aliwx.com.cn/reader?bid=7916775'),
(2, '科技时代', 1, 39.08, '热血 爽文 科幻 小说', 'https://www.aliwx.com.cn/reader?bid=102494'),
(0, '现代言情', 1, 39.08, '爽文 腹黑 霸道 总裁 小说', 'https://www.aliwx.com.cn/reader?bid=7405297'),
(1, '东方玄幻', 0, 59.65, '玄幻 修炼 东方 小说', 'https://www.aliwx.com.cn/reader?bid=6690593'),
(2, '现代言情', 1, 53.44, '腹黑 欢喜冤家 姐弟恋 小说', 'https://www.aliwx.com.cn/reader?bid=7705195'),
(0, '东方玄幻', 0, 43.81, '热血 玄幻 霸道 小说', 'https://www.aliwx.com.cn/reader?bid=6048839'),
(1, '古典架空', 1, 65.00, '王爷 轻松 王妃 美食 小说', 'https://www.aliwx.com.cn/reader?bid=7787060'),
(1, '纯爱', 1, 27.70, '爽文 轻松 机智 小说', 'https://www.aliwx.com.cn/reader?bid=7916777&cid=1167578'),        
(0, '古代言情', 1, 61.20, '重生 家长里短 美食 小说', 'https://www.aliwx.com.cn/reader?bid=7902279&cid=1141916'),

(1, '东方玄幻', 1, 29.99, '热血 爽文 升级文 小说', 'https://www.aliwx.com.cn/reader?bid=7918072'),
(2, '现代言情', 1, 32.66, '都市 现代 言情 小说', 'https://www.aliwx.com.cn/reader?bid=6953614'),
(0, '都市异能', 1, 53.65, '热血 爽文 异能 铁血 小说', 'https://www.aliwx.com.cn/reader?bid=7921260&cid=1188136'),
(1, '现代言情', 1, 29.32, '轻松 甜文 宠文 小说', 'https://www.aliwx.com.cn/reader?bid=7368416'),
(2, '东方玄幻', 1, 5.71, '爽文 男神 争霸流 小说', 'https://www.aliwx.com.cn/reader?bid=7102394'),
(0, '搞笑', 1, 5.71, '轻松 爆笑 萌系 小说', 'https://www.aliwx.com.cn/reader?bid=7797121'),
(1, '末世危机', 1, 79.75, '热血 爽文 种田文 杀伐果断 小说', 'https://www.aliwx.com.cn/reader?bid=7895784'),
(2, '日常', 1, 28.78, '爽文 轻松 爆笑 小说', 'https://www.aliwx.com.cn/reader?bid=7916772'),
(0, '现代言情', 1, 98.64, '轻松 欢喜冤家 专情 宠文 小说', 'https://www.aliwx.com.cn/reader?bid=7663113'),
(1, '青春年华', 1, 59.76, '轻松 小白 宠文 小说', 'https://www.aliwx.com.cn/reader?bid=7472601'),

(0, '古代言情', 1, 55.10, '轻松 日久生情 种田文 专情 小说', 'https://www.aliwx.com.cn/reader?bid=7884683'),
(0, '古代言情', 0, 43.19, '言情 古代 种田文 小说', 'https://www.aliwx.com.cn/reader?bid=6962538'),
(1, '幻想言情', 1, 95.78, '腹黑 霸道 虐恋 宠文甜文 小说', 'https://www.aliwx.com.cn/reader?bid=7473196'),
(2, '现代言情', 1, 99.15, '欢喜冤家 总裁 宠文 小说', 'https://www.aliwx.com.cn/reader?bid=7698036'),
(0, '古典架空', 1, 89.20, '帝王 公主 王妃 正剧 小说', 'https://www.aliwx.com.cn/reader?bid=7909838&cid=1151412'),
(1, '古典架空', 1, 69.26, '重生 女强 轻松 小说', 'https://www.aliwx.com.cn/reader?bid=7404676'), 
(2, '现代言情', 1, 60.20, '家长里短 日久生情 种田文 逆袭 小说', 'https://www.aliwx.com.cn/reader?bid=7907186'),
(0, '现代言情', 1, 42.43, '欢喜冤家 日久生情 同居 小说', 'https://www.aliwx.com.cn/reader?bid=7526273'),
(1, '现代言情', 1, 24.98, '医生 HE 励志 小说', 'https://www.aliwx.com.cn/reader?bid=7133080'),
(0, '现代言情', 1, 71.16, '欢喜冤家 傲娇 宿世情缘 小说', 'https://www.aliwx.com.cn/reader?bid=7391869'),

(0, '现代言情', 1, 86.95, '青梅竹马 失忆 正剧 逆袭 小说', 'https://www.aliwx.com.cn/reader?bid=7785703'),
(1, '穿越时空', 1, 81.39, '穿越 轻松 甜文 宠文 小说', 'https://www.aliwx.com.cn/reader?bid=7130249'),
(2, '现代言情', 1, 58.42, '励志 职场 正剧 小说', 'https://www.aliwx.com.cn/reader?bid=7914418'),
(0, '古代言情', 1, 36.40, '治愈 日久生情 种田文 宠文 小说', 'https://www.aliwx.com.cn/reader?bid=7934965&cid=1183631'),
(1, '幻想言情', 1, 52.18, '帝王 甜文 萌文 小说', 'https://www.aliwx.com.cn/reader?bid=7184589'),
(2, '仙侣奇缘', 0, 40.49, '轻松 欢喜冤家 小白文 小说', 'https://www.aliwx.com.cn/reader?bid=7097911'),
(0, '东方玄幻', 0, 49.56, '热血 爽文 穿越 废柴流', 'https://www.aliwx.com.cn/reader?bid=7405893'),
(1, "都市异能",0,734.21,"异能 都市 暧昧","https://www.aliwx.com.cn/reader?bid=6725806&cid=721665"),
(1, "东方玄幻",1,519.85,"玄幻 穿越异界","https://www.aliwx.com.cn/reader?bid=7010698&cid=769081"),
(1, "都市异能",0,611.39,"热血 爽文 重生 异术超能","https://www.aliwx.com.cn/reader?bid=7089483&cid=780212"),

(1, "都市生活",0,67.90,"爽文 家族冷酷","https://www.aliwx.com.cn/reader?bid=7955722&cid=1132245"),
(1, "转世重生",1,451.67,"重生 转世 报仇雪恨","https://www.aliwx.com.cn/reader?bid=6865973&cid=827756"),
(1, "东方玄幻",0,494.86,"热血 爽文","https://www.aliwx.com.cn/reader?bid=6720460&cid=712798"),
(1, "东方玄幻",0,452.54,"热血 玄幻","https://www.aliwx.com.cn/reader?bid=6813935&cid=719327"),
(1, "都市生活",0,46.17,"热血 爽文","https://www.aliwx.com.cn/reader?bid=7957189&cid=1191947"),
(1, "末世危机",1,518.55,"爽文 末世","https://www.aliwx.com.cn/reader?bid=7061552&cid=841448"),
(1, "东方玄幻",0,473.69,"热血 天才","https://www.aliwx.com.cn/reader?bid=6802438&cid=708131"),
(1, "都市生活",0,141.91,"爽文 轻松","https://www.aliwx.com.cn/reader?bid=7654310&cid=963672"),
(1, "恐怖惊悚",0,126.31,"推理 热血","https://www.aliwx.com.cn/reader?bid=7520672&cid=946544"),
(0, "现代言情",1,68.17,"轻松 暗黑 正剧","https://www.aliwx.com.cn/reader?bid=7517677&cid=960266"),
(0, "古典架空",1,140.54,"穿越 甜文","https://www.aliwx.com.cn/reader?bid=7089610&cid=757475"),
(0, "现代言情",0,103.72,"宝宝 总裁","https://www.aliwx.com.cn/reader?bid=7736338&cid=1101190"),
(0, "现代言情",0,141.23,"重生 女强","https://www.aliwx.com.cn/reader?bid=7865356&cid=1109317"),
(0, "现代言情",1,100.55,"总裁 小白","https://www.aliwx.com.cn/reader?bid=7738166&cid=1128538"),
(0, "现代言情",0,173.26,"重生 家长里短","https://www.aliwx.com.cn/reader?bid=7864935&cid=1157174"),
(0, "穿越时空",1,208.89,"爽文 重生","https://www.aliwx.com.cn/reader?bid=7402153&cid=889670"),
(0, "古代言情",0,98.44,"宝宝 种田文","https://www.aliwx.com.cn/reader?bid=7892880&cid=1159481"),
(0,  "穿越时空",0,370.49,"爽文 穿越","https://www.aliwx.com.cn/reader?bid=7119057&cid=830768"),
(0,  "古代言情",0,166.66,"爽文 女强","https://www.aliwx.com.cn/reader?bid=7104214&cid=762249"),
(0,  "古典架空",0,195.27,"种田 言情 古代 小说","https://www.aliwx.com.cn/reader?bid=6772378&cid=715306"),

(0,  "现代言情",1,163.83,"甜文 都市生活","https://www.aliwx.com.cn/reader?bid=7063285&cid=861651"),
(1,  "古风",1,53.65,"爽文 轻松 爆笑","https://www.aliwx.com.cn/reader?bid=7834462&cid=1087285"),
(0,  "魔幻",1,64.53,"学生 死神 肥宅 小说","https://www.aliwx.com.cn/reader?bid=7797140&cid=1093130"),
(0,  "58.4",1,58.4,"轻松 青春 肥宅 小说","https://www.aliwx.com.cn/reader?bid=7795044&cid=1085383"),
(1,  "科幻",1,42.2,"热血 爽文 科幻 小说","https://www.aliwx.com.cn/reader?bid=7850443&cid=1061076");
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (1,  "",,,"",""),
-- (2,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (0,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (1,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),
-- (2,  "",,,"",""),

-- 评论表 comments
create table comments (
    id int unsigned auto_increment primary key not null comment "评论id",
    novel_id int unsigned not null comment '小说id',
    users_id int  unsigned not null comment '评论用户id',
    content varchar(500) not null comment '评论内容',
    is_pass tinyint(1) not null default 0 comment '是否通过审核 0 未通过，1 通过，默认未通过',
    count_praise int unsigned not null default 0 comment '点赞数量 默认为0',
    create_time int unsigned not null comment '评论时间'
);
insert into comments(novel_id, users_id, content, create_time) values(1, 1, '写得很精彩', 1569921909),
(1, 2, '写得太好了', 1549013109),
(2, 1, '很有趣', 1549099509),
(2, 2, '很棒棒', 1517541909);





-- 回复表 reply_comments
create table reply_comments (
    id int unsigned auto_increment primary key not null comment '回复id',
    comment_id int not null comment '评论 id',
    front_id int not null comment '评论人 id',
    current_id int not null comment '回复评论人id',
    content varchar(500) not null comment '回复内容',
    is_pass tinyint(1) not null default 0 comment '是否通过审核 0 未通过, 1 通过, 默认未痛过',
    create_time int not null comment '回复时间'
);
insert into reply_comments(comment_id, front_id, current_id, content, create_time) values(1, 1, 2, '用户1 说的好', 1570699740),
(1, 2, 1, '用户2 说的好', 1570958940);






-- 点赞表 praise
create table praise(
    id int unsigned auto_increment primary key not null comment '点赞 id',
    users_id int unsigned not null comment '用户 id',
    comment_id int unsigned not null comment '评论 id',
    praise_status tinyint unsigned not null comment '状态: 0-已取消点赞 1-有效点赞',
    create_time int unsigned not null comment '创建时间戳'
);
insert into praise(users_id, comment_id, praise_status, create_time) values(1, 1, 1, 1565437923),
(2, 2, 1, 1549799523);



-- charges 充值表
create table charges(
    id int unsigned auto_increment primary key not null comment '充值 id',
    users_id int unsigned not null comment '用户id',
    charge_coin tinyint(1) not null comment '充值余额 0=5元（50书豆）,1=10元（100书豆）,2=20元(200书豆), 3=30元300书豆',
    order_num int unsigned not null comment '时间戳当订单号',
    charge_type tinyint(1) not null comment '0 微信, 1 支付宝',
    charge_time int unsigned not null comment '充值时间',
    order_state tinyint(1) not null comment '0 处理中 1已支付'
);
insert into charges(users_id, charge_coin, order_num, charge_type, charge_time, order_state) values(1, 0, 1565437923, 0, 1565437923, 0);



-- 验证码表
create table codes (
    id int unsigned auto_increment primary key not null comment '验证码 id',
    phone char(11) not null comment '用户 手机号',
    verifyCode varchar(6) not null comment '验证码'
);




